{
  "protein": {},
  "cheese": {},
  "cow": {},
  "bacon": {},
  "hitler": {
    "description": "Hitler was vegetarian",
    "rules": "Pol Pot, Charles Manson, anyone who clearly did terribly cruel things",
    "main": [
      "OK this is Vegan Bingo, and none of these people are claimed to be vegan, but we hear this so let's go. We should first acknowledge that some evil people might have eaten some vegetables at some point in their lives. We also acknowledge the statistical likelihood that out of the many millions of people who've led vegetarian lives a certain number would have been bad people.",
      "Tolstoy said vegetarianism is a sign someone's pursuit of moral perfection is sincere. I'd probably update that to veganism, and it sounds nice but not everyone gives up eating meat for ethical reasons. Health, religion, culture, digestion issues, allergies and to impress a hot vegan friend, are all pretty common. Most people are ethical in some areas but have moral blind-spots in others, so we need to know more about someone than one trait. Families in India have abstained from meat for centuries, but it's doubtful every single person they produced was some sort of Ghandian figure. Vegetarians, and vegans are flawed people too, most of are just trying to figure out this life and get a little better ethically we go along.",
      "Now let's talk about Hitler. He ate meat until he was almost 50, by which time he had ruled Germany for years, was having people killed and put in concentration camps. He had long term stomach problems, and some say doctors put him on a vegetarian diet around 1937. If someone snuck meat into his food, and people seemed to have done this repeatedly right to the end, he would complain about it hurting his stomach. So how much this was really motivated by ethics is hard to tell. Hitler did show some concern for animals and the Nazis did enact laws against animal cruelty, but if people like the Nazis were just pure evil history would be a lot simpler. They also had social programmes and helped poor people, so they were incomprehensibly vile but not every single thing they did necessarily was.",
      "On to Pol Pot and his murderous regime. This was relatively recent, the people who cooked for him are still alive, and they say he ate all sorts of things, fish, cobra, boar etc. An official who knew him seemed to say he was a vegetarian, but who knows what they were basing that on. As a byline we have to understand that many people get confused about what vegetarian means, especially in the past. Studies show that even today, many older people don't understand the term as well as younger people do when asked to define it. Surveys of diet have had to be amended because of the poor understanding of vegetarian and vegan. For instance, after they ask if people are vegetarian or vegan, they now ask questions like \"When was the last time you ate chicken?\" to try to make sure.",
      "Finally Manson, the Internet has failed me here. A lot of slightly unhinged websites kind of gleefully say he was, a couple of less unhinged ones stating it without giving any evidence for it. Still although he hated hippies and thought they were weak, he dressed like one so maybe he ate like one. Will leave this one at inconclusive.",
      "So what motivates the repetition of this claim about Hitler etc to people who don't eat meat? There seems to be a need to pre-emptively attack a vegan or vegetarian because they imagine being judged. People want moral status, but it can inconvenient to earn it, they might have to swap some ingredients in their diet for instance. So they are left in an uncomfortable state, and this is what's called cognitive dissonance. They don't want to change, but don't want to feel bad about having animals killed for them, so they need to to find intellectual justifications that how they already behave is a morally correct position. So you get \"Hitler was a bad person, hitler was a vegetarian, vegetarians are bad people\"; Aristotle wouldn't have thought much of that logic but it will do for someone looking for any available exit from a moral quandary.",
      "It is also poor statistics, you can't make widespread inferences from cherry picked examples. Mao Tse Tung, Joseph Stalin, Talat Pasha, Suharto, Saddam Hussein, Atilla the Hun, Genghis Khan, Nero, Caligula, King Leopold, Idi Amin, Vlad the Impaler and of course most of the rest of the Nazis were meat eaters. So were lots of good people, but as we said most people have at least one moral blind spot.",
      "Veganism is is a movement of millions it is bound to have some crazies and even killers, but when properly understood it is about compassion and consideration for all life, especially those intelligent, sensitive humans."
    ]
  },
  "plants": {
    "description": "Plants have feelings",
    "rules": "Carrots scream when you cut them!",
    "main": [
      "Sadly people who say things like this aren't some sort of level 9 compassionate souls, but are even less likely to care about plants than they do animals.",
      "So yes, it's a ridiculous question. Most of the animals we eat are herbivores, and eating them means even more plants are killed than if we just ate plants directly. Also plants don't have a central nervous system, evolutionarily it's not very useful to feel pain if you can't do something in response to it, like run away.  Plant biology is many and varied, there is more to be said here, but it would probably lost on anyone silly enough to ask this question.",
      "Ignoring them, there is a serious point for us to think about here. In evolutionary terms there aren't distinct, easily identifiable separate kingdoms of plants and animals, it is all very much a continuum. We need to ask ourselves where we draw the line and on what basis we do so.",
      "Darwin and the best biologists since have understood that our common evolutionary heritage expresses itself in us sharing much of our sentience with other beings. In understanding how we should treat other beings ethically we should discuss levels of self awareness, the ability to suffer, the presence of a central nervous system, in all of which science should be our guide. This philosophy is called sentientism, that all animals interests deserve consideration. This is opposed to speciesism, which treats all non human life as having lesser worth, not because of their innate capabilities, but purely because they are not human.",
      "Humans are a destructive force on the animal world, and modern technology has only increased this. The time is well past when we should reconsider the philosophies and ways of living which have led to this reality. Maybe considering the interests of beings other than humans, including plants, is actually something we should take seriously.",
      "We need to re-evaluate our moral framework, we must rethink very carefully about where we draw our moral lines, of our obligations to the other beings who share our world. In the end if we err in that endeavour let us err on the side of compassion."
    ]
  },
  "teeth": {
    "description": "We have canine teeth",
    "rules": "Meat eating caused human brains to grow. Our eyes are forward looking like a carnivore.",
    "main": [
      "Canine are a description of a two of our teeth, also called cuspids, eye teeth and a few other things. Lots of animals have them, antelopes, deer, camel, horses, boar, seals, walrus. Human canine teeth look rather lame compared to some of our completely herbivorous relatives. Gorillas have pretty fierce ones, and other than eating insects, live on plants. Canine teeth are used for gripping and tearing food, dominance displays and weapons, but they don't mean an animal eats meat.",
      "It is unfortunate that the name canine has caused so much confusion. Having canine teeth provides no more justification for eating meat than our \"achilles\" tendon means we are all invulnerable warriors.",
      "Human teeth are omnivorous teeth. Actually look in a carnivore's mouth sometime, then look in a herbivores mouth. You'll see pretty clearly ours resemble the latter, and of course they do, like all the other apes during our evolution we lived primarily on plants. Some of our closest relatives such as chimpanzees eat meat, but it is an incidental part of their diet.",
      "As for meat eating helping our evolution, well any additional source of nutrients is helpful, but there isn't a great amount of evidence for this proposition. Far more compelling evidence is that it was cooking and the extra foods we could eat, especially the starches that probably fuelled our brain development. It is a difficult area though, looking back to such ancient times, so thus rash claims are unwarranted.",
      "Forward facing eyes is a strange one but it comes up. We have two separate eyes to enable depth perception just like most animals. The theory is that for prey species they are wider apart, giving them better peripheral vision to see attackers. So far so good, where it gets muddled is in people thinking that if you don't have eyes on the sides of your head, that makes you a carnivore. I was going to list animals which have forward facing eyes and are herbivores or omnivores, or ones which have eyes on the sides of their heads and are carnivores, but I figure you can do that yourself. Once you've done that for about five seconds you'll understand that eye placement is no clear evolutionary sign of any single thing.",
      "Overall the science in respect of human anatomy and diet is pretty clear, though we have been omnivores for many hundreds of thousands of years our anatomy is still predominantly that of a herbivore. We have opportunistically supplemented our diet with meat whilst primarily surviving on a plant based diet. It is no surprise that dietitians are always telling us to eat more fruits and vegetables, because that is what we are evolving to primarily eat.",
      "Ultimately, if we can live healthily on a variety of different diets, then it is up to our conscience not our biology to choose which we should adopt."
    ]
  },
  "humane": {
    "description": "What about backyard chickens?",
    "rules": "What if animals were farmed humanely?",
    "main": [
      "The amount of meat people eat, the prices they want to pay for it and the number of people eating it have all lead directly to the modern industrial factory farm, one of the cruelest things humankind has ever created. A lot of people talk about humane farming as an alternative, but for all those that talk about about it few people are supporting it consistently with their money. It's like the fantasy of humane factory farms and slaughterhouses somehow creeps into the real world and gives people a clear conscience about the treatment of farmed animals.",
      "People say eating a vegan diet is difficult, which most vegans will tell you isn't true, but in any case trying to live as a so-called \"compassionate carnivore\" is much harder, which is why I've never met one who did it with any consistency. Some people might buy some more humane animal products to eat at home, but that's about the extent of the trouble they are willing to go to. Their ethics don't seem to apply to pre-made food products they purchase, which contain animal ingredients sourced with little consideration for their welfare. Their concern for ethically raised animals also doesn't seem to matter when out at restaurants or cafes, or when they are buying shoes, clothes and other products.",
      "A vegan going to a restaurant or friends house can simply avoid animal products, whereas the compassionate carnivore has to go into almost historical detail about the products used, or eat vegan anyway if the choices available turn out to be from factory farms. They are also going to be out of pocket, as much of the cruelty involved in the animal farming system is to keep costs down. Vegans can turn to cheap legumes and beans, but people who want to eat more compassionately whilst continuing to eat animals multiple times a day are going to be spending a lot more of their income on food. Cheap meat means cruelty.",
      "Backyard farming has emotional appeal but little else. Abuses could be worse, the unregulated nature of it could lead to more painful deaths and lower standards of care. Also the modern factory farmed animal has not been bred with it's own welfare in mind. As an example, chickens in the wild lay maybe a couple of dozen eggs each year. The modern factory farmed chicken has been bred to lay one every day. This takes a terrible toll on their bodies, animal sanctuaries put them on hormones which slow this down to give them a chance to recover, but even this can't be done long term. Chickens will live up to 10 years naturally, but egg laying factory farmed chickens are killed at younger than two years old because their bodies simply can't take it. Most people aren't aware of the fact that these animals have been bred to be profit making machines when they decide to take on farmed animals at home.",
      "If people care about the animals they are raising, maybe even treat them as part of the family as they do their pets, it would mean an improvement in animal welfare. Of course the average home would have to have quite a lot of animals to sustain the levels of meat eating they currently do.  It's hardly going to happen in the small apartments of the millions of city dwellers, but sure if you have some land and you just have to kill animals to eat it might be better. For a vegan keeping an animal captive and prematurely killing it is always a form of oppression, but even oppression exists on a scale, and ",
      "If people really do want to get involved in backyard farming whilst caring about animals, they could rescue a couple of hens from a factory farm and let them live out their lives in relative peace."
    ]
  },
  "food": {
    "description": "Don't eat things resembling meat",
    "rules": "Asking whether any given vegan alternative is made of tofu...which is all vegans eat apparently",
    "main": [
      "For a start, most animal products do not look like animal products. I don't want to spoil any childhood delusions, but fish don't actually have fingers.  Cheese, sausages, fish fingers, they are all creations for a culinary purpose.",
      "Take a burger, is that really an animal food?  People are overly focused on the animal products in a meal when they are often just a portion of the total calories.  In your average fast food hamburger, the patty itself often has grains, flavours, herbs, spices, onions and flour or breadcrumbs added to it.  It is then encased in tomato, lettuce, pickle, onions (beetroot in Australia!) and bread, smothered in sauces.  Often the meat is less than a fifth of the end product which doesn't in anyway resemble, or even taste like the animal that small part came from.  If a vegan replaces that with some other form of protein, we end up with a pretty similar product.",
      "When it comes to what we replace animal protein with, we have a wide array, not just tofu.  Nuts, seeds, grains, vegetables, legumes, yes and soy such as tempeh and tofu all have protein which we can use to make chewy textures in our food.  Plant based foods are getting better and more varied all the time as veganism grows, so we should encourage non vegans to give them a try as a convenient way to have a familiar, but meat free meal.",
      "Ultimately people who ask this are missing the point.  It is oppression and violence that we oppose, not a particular ingredient's texture, shape or flavour. Many vegans avoid products resembling animal foods because they have uncomfortable connotations for them, and that is their right.  Others are happy eating anything so long as they aren't contributing to factory farming, and that is their right.  Both are ethical choices.  People eating animals should focus on the ethics of what they eat, as opposed to the aesthetics of what vegans eat."
    ]
  },
  "natural": {
    "description": "Killing is part of nature",
    "rules": "Making appeals that it has been done for a long time.",
    "main": [
      "OK this gets philosophical so bear with me (no not that sort of bear!).",
      "As much as humans wish for a moral ordered universe, the laws which govern the one we live in are amoral. Good things happen to bad people, terrible things happen to good people, all governed by elegant but soulless cosmic mathematical principles.  It would be nice if it did, but natural just simply does not equal right, just or ethical.",
      "To say then that something is natural and that this is alone needed as a moral defence of the action, would be to ignore the vast number of natural but terrible things that go on. Massive outbreaks of deadly disease used to be common; to intervene with medicine is not purely natural, but surely it would be immoral to do anything else.  Cannibalism, slavery, warfare, all sort of atrocities have long and common histories amongst people, so are they natural and if so is that some valid ethical defense of them?",
      "We make advances in society in fields such as law, justice, democracy, modern medicine and philosophy not by appeals to what is natural but what is best.  Why would the ethics of the way we treat animals be any different.  If we can be just as healthy eating a diet which doesn't oppress tens of billions of other creatures who we share this earth with, then why wouldn't we?",
      "Finally to call the modern diet natural, or the factory farming system with animals locked in cages, in windowless sheds, behind barbed wire, to call all of this abomination natural is to render the word meaningless.",
      "Freedom is the state every sentient being desires.  Vegans help them achieve that natural state."
    ]
  },
  "eat": {
    "description": "What can you eat?",
    "rules": "Oh you are vegan, that must be hard. Veganism is expensive.",
    "main": [
      "Veganism just isn't that hard, as my friend once said, \"Take out the animal things, replace with plant things. Done\".  Not hard.  Maybe slightly harder than not changing at all, but even then after a few weeks it becomes pretty much the same.",
      "Indeed it is often the opposite of a restriction once you try it.  On becoming vegan people discover an expanded world of new and interesting ingredients to explore. Many people also use the process of becoming vegan to transition to a healthier diet, by following all that nutritional advice of \"Eat more fruits and vegetables\".",
      "So if you are eating a healthy diet already, 90% of it is probably already vegan, and the other 10% you just replace with nuts, seeds, beans, legumes, grains, tofu, tempeh, seitan, the ever widening variety of convenient substitute products and plant based milks, soy, almond, macadamia, oat, rice, hemp, quinoa and coconut.  Take a B12 supplement and you are done. If you like there's everything else these days too, plant based cheeses, marshmallows, milk chocolate (most dark choc is already vegan of course), condensed milk, mayonnaise, yoghurt, haggis, black pudding, you get the idea.",
      "Now you will note many of those sources of protein are some of the cheapest things you can feed yourself on, beans, legumes, grains.  Even tofu and tempeh are about as cheap as even budget animal products.  Somehow there is an idea out there that being vegan is expensive.  Like any diet it can be if you choose expensive things.  Pretty much the only expensive vegan ingredients that differ to the modern western diet are the meat and cheese analogues.  You don't have to choose to eat these, or maybe just have them on special occasions.  A vegan diet based on fruits, vegetables and wholegrains is one of the cheapest and healthiest diets out there.",
      "Being vegan is not hard, as much as people might prefer to think it is. As there are more and more vegans all the time, it gets easier too.  The main thing that makes it trying sometimes is the knowledge that there aren't more of us."
    ]
  },
  "notmuch": {
    "description": "I don't each much meat",
    "rules": "Telling you they ate a vegetarian meal recently.",
    "main": [
      "This is a positive and healthy statement, but often people who assert this eat meat every day, often for lunch and dinner, sometimes even breakfast.  I'm not sure what it means actually, maybe that they eat more vegetables than they used to, which is healthy but of little solace to the animals unless it is displacing them in the persons diet.",
      "Our ideas of what a normal diet is are culturally shaped. The fact that someone eats less meat than their unhealthy friend, or chooses fish or chicken instead of red meat, does not equate to not eating much meat.",
      "The average person eats much more meat than is considered healthy. Per capita animal product consumption has risen far above historical levels in many countries.",
      "If someone has more days vegetarian than otherwise, or they only eat meat one meal a day, then they might be able to claim to be not eating much meat, otherwise they are probably eating more than they should.",
      "Obviously for the animals who live and die in agribusiness systems before ending up on a dinner plate, the optimal amount would be zero."
    ]
  },
  "what": {
    "description": "But what about people?",
    "rules": "Some people care more about animals than they do people.",
    "main": [
      "The premise of this statement is that whilst there is human suffering, we shouldn't concern ourselves with the suffering of other animals. Vegans don't believe that such a choice needs to be made and care about the suffering of all animals, humans included.",
      "Indeed they are often related: caring for the environment benefits all who share the earth, teaching compassion helps all who can suffer, switching to a plant based diet is going to allow more food for people to be grown with less land used providing habitat for other animals.",
      "The idea that humans are in a different sphere to all other animals is a pre darwinian conception of ourselves, scientific secular understanding informs us that we are relatives in the same family tree who share traits. All who can suffer deserve consideration and of primary relevance to own conscience should be those who suffer as a direct consequence of how we choose to live.",
      "As many philosophers have said, ethics is like a muscle that goes stronger with use. We should be encouraging compassion in all spheres of life, not playing them off against each other.",
      "Ultimately the question is flawed, people are animals too. We withdraw our support and consent to the unnecessary suffering of all animals, humans included."
    ]
  },
  "cant": {
    "description": "Oh, you can't eat that",
    "rules": "Some ridiculous thing they think isn't vegan.",
    "main": [
      "It is interesting that people frame our avoidance of animal products with the word \"can't\" as if it were not voluntary, rather than \"won't\" which reflects a conscious choice.",
      "Vegans can eat whatever they want, they actively choose not to eat certain products out of concern for the animals involved. Even carnists often refuse to eat some species such as whale, rat or dog, not because they can't but on the basis of habit, cultural or ethical norms.",
      "Vegans take that ethical stance to its logical conclusion. We make active choices based on our principles.",
      "To vegans it's very simple what we eat, wear etc, if it comes directly from an animal, we steer clear of it.  Some other people tend to get enormously confused by the concept, like it has to be hard or something. I've had people ask me if I can eat avocado, peanut butter and even if I could wear cotton - see how you go.  Ultimately it's about educating people, but it would be nice if they thought their comments through a little first."
    ]
  },
  "aspirational": {
    "description": "I'd love to be vegan, but...",
    "rules": "I was vegan/vegetarian but...",
    "main": [
      "The more mainstream veganism becomes and the more society understands the multitude of reasons for living vegan, the more we hear this. It's a sign that veganism has arrived.",
      "Of course as vegans we know it's easy to be vegan in most places, and we can get by in most others with a bag of nuts, some bread and salad to tide us over. Why people don't make the transition has more to do with habit and conformity than anything else.",
      "Ultimately though it is a positive aspirational statement and should be encouraged.  Each time a person says this is a chance to help them achieve something for themselves. Gently gently, we might start by showing them all the free online resources to help them with recipes and advice, then show them the local restaurants or shops stocking vegan products, and probably the most convincing advocacy: introducing them to delicious vegan food and lovely varied vegan people.",
      "For people who used to be vegetarian or vegan, it's often the case that they return to it when their mindset and life is in the right place. Helping people who are already aware of the need for change is one of the most fruitful forms of activism. Also when you meet ex-vegetarians or vegans, it's a good reminder to us that we need to support our own community in our activism, not just focus on making new converts."
    ]
  },
  "preachy": {
    "description": "Vegans are preachy",
    "rules": "Each to their own, the sadly ironic \"live and let live\", or the old joke how do you know someone's vegan - they'll tell you",
    "main": [
      "Granted there are some preachy vegans who need to chill out, but as vegans reflect the diversity of people generally there isn't a stereotype. Anyone who has had bad experiences with a preachy vegan though should try being vegan for a while and see how the reverse is also true.  Not all vegans are preachy, not all people who aren't vegans are tools about it.",
      "It's all perspective too, when local activists erected a billboard showing an injured race horse that was shot, they were forced to take it down as a disturbing image.  Of course our suburbs are littered with burnt charred images of dead animals in food advertisements and no one blinks an eye.  If the vast majority of people agree with you, preachiness seems to go unnoticed.",
      "Ultimately this comes down to people's idea of what life is all about, some think it is just about being popular and conforming, and they can't understand people who would expend their social capital advocating ethical beliefs. They might even express this point of view in cliches such as 'to each their own' or 'live and let live' (if only they would let the animals just live). But as frustrating as we might find this, getting upset with someone is likely to be counter-productive.",
      "We can speak the best for animals by engaging peoples compassion rather than their self defensiveness. Whether we like it or not, how we present the message is almost as important as the message itself.  Positive people living in alignment with their ideals are the best advocates for veganism."
    ]
  }
}
