{
  "protein": {
    "description": "Where do you get protein?",
    "rules": "Where do you get your iron, or some weird trace element.",
    "main": [
      "The real question is \"Why are people worried about protein and nothing else?\". Meat and dairy industry advertising reaches far more people than any unbiased nutritional advice. There's also a lot of poorly based folk wisdom left over from our long history of eating animals.",
      "There has never been any study which has shown protein deficiency in people following a plant based diet. Protein deficiency is unknown in any population that eats enough calories.",
      "Still I've had scores of people ask me this, from people as young as 10 to elite medical professionals. For some reason it pervades the culture, and most medical professionals simply don't get much nutritional training. When you look at what the peak nutritional bodies in the world say, you find similar things to the position of the American Dietetic Association:",
      "\"appropriately planned vegetarian diets, including total vegetarian or vegan diets, are healthful, nutritionally adequate, and may provide health benefits in the prevention and treatment of certain diseases. Well-planned vegetarian diets are appropriate for individuals during all stages of the life cycle, including pregnancy, lactation, infancy, childhood, and adolescence, and for athletes.\"",
      "People who ask about protein also rarely even know how much protein we need. A rough guide is your weight in kilograms times 0.8 to 1.8 grams depending on how much weight bearing or endurance exercise you do.",
      "Finally there is a serious point here, a vegan diet is different to the one many of us grew up eating. If you follow a vegan diet there are some things you need to think more about (B12, calcium, vitamin D, omega 3s), and others you can worry less about (Fibre, eating enough fruit and veg, Saturated Fat), but protein doesn't really come in to the picture.",
      "In the end we should be getting our nutritional advice from university qualified Dietitians, not random people or a Vegan Bingo app on the Internet. Better diets will lead to better well being, as Hippocrates said, 'Let thy food by thy medicine'."
    ]
  },
  "cheese": {
    "description": "I could never give up cheese",
    "rules": "You are not going to need any other acceptable answers because you will be hearing this one repeatedly.",
    "main": [
      "The second part of the statement \"I could never give up cheese\" should be \"no matter how much cruelty is involved\".  Hopefully this is simply untrue though, I hope most people are not simply slaves to habit and can instead be motivated by their ethics.",
      "Maybe people would find it easier to give up cheese if they understood that it's not a particularly healthy thing to eat, is a foundation of the cruel veal trade, is part of an environmentally reprehensible industry and ultimately leads to an unnaturally short, diseased life with regular forced pregnancies for the cows themselves.  Hopefully doing the right thing by these gentle beings would be enough to motivate them to replace just one of the hundreds or thousands of possible ingredients in their diet.",
      "There are mock cheeses which are getting better all the time.  Even if they weren't perfect I'd rather eat them than something produced unethically. In the end as someone once said, \"I couldn't give up cheese, so instead I gave up cruelty\"."
    ]
  },
  "cow": {
    "description": "What about all the cows?",
    "rules": "Cows like to be milked! It shows a similar complete misunderstanding of how dairy cows are bred and for what purpose.",
    "main": [
      "Factory farm breeding is strictly controlled by the farmers and companies.  It is mostly done artificially and thus we just would simply need to stop bringing more cows, chickens, pigs etc into the world.",
      "The idea that calves are a product of natural breeding has more to do with deluded visions of the countryside than intensive industrial animal farming.  There is very little natural about it, the cows boddies are engineered not for their health or well being, but for human purposes, such as abnormally quick growth or over-sized udders.",
      "Anyway getting back to reality, it is unlikely that a change to a vegan world will happen overnight so it's not going to be a problem.  Our carnist friends can therefore just go ahead and become vegans, without losing sleep over the terrible notion of billions of these gentle creatures rampaging cross the countryside."
    ]
  },
  "bacon": {
    "description": "Mmmm \"Bacon\"",
    "rules": "Steak, chicken, often with a but at the start or mmm at the end.",
    "main": [
      "But cruelty, mmm....",
      "There are some good jokes at the expense of vegans, the best of them are clever, unique and unexpected.  This particular attempt at a joke has none of these qualities.  Despite this vegans are continually subjected to it in any number of situations, on a web social thread, in a conversation about food, over dinner etc.",
      "In Internet terms this could be called a \"troll\", something which has no depth to it other than being offensive.  It's not just animals who are the subject of this sort of humour, disabilities, sexism, racism, child abuse, slavery, rape, the holocaust, anything that crosses accepted social and moral lines is used.  Whilst many argue over whether some areas should or shouldn't be joked about, when people are actually participating in the acts they are being deliberately offensive about it moves from the realm of harmless humour to one of harmful justification.",
      "In psychological terms this is called a cold joke.  It's been witnessed in atrocities towards humans for centuries.  Those perpetrating the act try to distance themselves from their actions by using humour to avoid dealing with the psychological ramifications of something upsetting or disturbing they are participating in.  Pigs, cows, chickens etc, most people are aware that these are thinking, feeling beings that we share our evolutionary kinship with.  As more of them suffer and die in our industrial slaughter system every week then humans who have been killed in wars in all human history, people need to figure out a way to avoid having this disturb their conscience.",
      "Those whose hands are stained by the blood of this terrible industry could at least have some respect for the creatures who suffer and die for them.  Instead they choose to make an offensive comment.  The best we can hope for is that 'They know not what they do'."
    ]
  },
  "hitler": {
    "description": "Hitler was vegetarian",
    "rules": "Pol Pot, Charles Manson, anyone who reflects poorly on our species",
    "main": [
      "We acknowledge evil people might have eaten vegetables at some point in their lives, maybe even lots of vegetables.  We also acknowledge the statistical likelihood that out of hundreds of millions of people who've lead vegetarian lives a couple might have been bad people.",
      "So what this is probably about is trying to avoid feeling morally inferior by bringing down others, others who might be trying to do something ethical in their lives.  For some reason people like to feel moral, but it can pretty inconvenient to act morally, you might have to give up cheese for instance, so better to find an intellectual loophole out of the moral obligation.  Hitler was a bad person, hitler was a vegetarian, vegetarians are bad people, naive logic at best but will do for someone looking for any way out of an ethical dilemma.",
      "It makes as little sense statistically as it does logically.  Even if a couple, or even a handful of bad people are vegetarians, this means by association that all the other bad people aren't.  Mao Tse Tung, Joseph Stalin, Talat Pasha, Suharto, Saddam Hussein, Atilla the Hun, Genghis Khan, Nero, Caligula, King Leopold, Idi Amin, Vlad the Impaler and the rest of the Nazi top brass all ate animals, so what does that prove?  It's just straight up unscientific to draw widespread inferences from a couple of examples.",
      "Now that we've dealt with how silly a statement thie would be if it were true, we can state that of course the facts are wrong.  Hitler, Pol Pot, neither were ethical vegetarians, they did so for short periods due to health problems and Hitler certainly would rather be eating his favourite pork sausages.  The Nazis did enact some laws against animal cruelty, they also had the Winter Relief programme helping the poor during the cold months, so on the whole they were evil but not every single thing they did necessarily was.",
      "Veganism is about compassion for all animals, humans included. None of these people got that, some people are dietary vegans or vegetarians, that is really different to being ethical vegans or vegetarians.  Ethics is what our movement is about and that makes all the difference."
    ]
  },
  "plants": {
    "description": "Plants have feelings",
    "rules": "Carrots scream when you cut them!",
    "main": [
      "Sadly people who ask this aren't some sort of level 9 compassionate souls, but are even less likely to care about plants than they do animals.",
    "So yes, it's a ridiculous question.  Most of the animals we eat are herbivores who eat plants anyway, so eating animals means even more plants are killed than if we just ate plants directly.  Also plants don't have a central nervous system, evolutionarily it's not very useful to feel pain if you can't do something in response to it, like run away.  Plant biology is many and varied, there is more to be said here, but it would probably lost on anyone silly enough to ask this question.",
      "Ignoring them, there is a serious point for us to think about here.  In evolutionary terms there aren't distinct, easily identifiable separate kingdoms of plants and animals, it is all very much a continuum.  We need to ask ourselves where we draw the line and on what basis we do so.",
      "Darwin and the best biologists since have understood that our common evolutionary heritage expresses itself in us sharing our sentience with other beings. In understanding how we should treat other beings ethically we should discuss levels of self awareness, the ability to suffer, the presence of a central nervous system, in all of which science should be our guide.",
      "We should not draw a line based on simplistic categories like plants, animals, insects, fish, but instead on our ever advancing knowledge of human and non human biology. In the end if we err in that endeavour let us err on the side of compassion."
    ]
  },
  "teeth": {
    "description": "We have canine teeth",
    "rules": "Meat eating caused human brains to grow.  Our eyes are forward looking like a carnivore.",
    "main": [
      "Human canine teeth look rather lame compared with the ones sported by our cousins the gorillas, some of whom are known to eat insects but pretty much follow a vegan diet otherwise. Indeed all great apes have canine teeth used mainly for dominance displays and as weapons against each other.  None are known to have any more than a small fraction of their diet coming from eating other animals.",
      "It is unfortunate that the name canine has caused so much confusion.  The presence of canine teeth provides no justification for eating meat any more than our \"achilles\" tendon compels us to the live like an ancient greek warrior.",
      "As for meat eating helping our evolution, well it is another source of food so another option is helpful, but the evidence is that it was cooking and the extra starches available in our diet that probably fuelled our brain development.  Anyone who reads up on the science in this respect would know that the jury is still out, and thus rash claims are unwarranted.",
      "Forward facing eyes is a strange one but it comes up.  We have two separate eyes to enable depth perception just like most animals.  The theory is that for prey species they are wider apart, giving them better peripheral vision to see attackers.  So far so good, where it gets muddled is in people thinking that if you don't have eyes on the sides of your head, that makes you a carnivore.  I was going to list animals which have forward facing eyes and are herbivores or omnivores, or ones which have eyes on the sides of their heads and are carnivores, but I figure you can do that yourself.  Once you've done that for about five seconds you'll understand that eye placement is no clear evolutionary sign of any single thing.",
      "Overall the science in respect of human anatomy and diet is pretty clear, though we have been omnivores for many hundreds of thousands of years our anatomy is still predominantly that of a herbivore.  We have opportunistically supplemented our diet with meat whilst primarily surviving on a plant based diet.",
      "Ultimately, if we can live healthily on a variety of different diets, then it is up to our conscience not our biology to choose which we should adopt."
    ]
  },
  "humane": {
    "description": "What about backyard chickens?",
    "rules": "What if animals were farmed humanely?",
    "main": [
      "A lot of people talk about humane farming, but for all those that talk about about it few are at all rigorous about doing it or supporting it consistently with their money.",
      "People might buy some more humane animal products to eat at home, but completely inconsistently.  This concern also doesn't seem to extend to the factory farmed animals used by the restaurants and cafes they visit, or even the ones used to make their shoes, clothes and other products.",
      "People say eating a vegan diet is difficult, which it isn't, but living the myth of the compassionate carnivore sounds  much harder.  A vegan going to a restaurant or friends house can simply avoid animal products, whereas the compassionate carnivore has to go into almost historical detail about the products used, or eat vegan anyway if the choices available turn out to be from factory farms.  They are also going to be out of pocket, as much of the cruelty involved in the system is to keep costs down.  Vegans can turn to cheap legumes and beans, but people who want to eat more compassionately whilst continuing to eat animals multiple times a day are going to be spending a lot more of their income on food.",
      "Backyard farming has emotional appeal but little else.  Abuses could be worse, the unregulated nature of it could lead to more painful deaths and lower standards of care.  Ultimately suffering exists on a scale.  If people care about the animals they are raising it could mean an incremental improvement in animal welfare, though to a vegan keeping an animal captive and prematurely killing it is always a form of oppression.",
      "If people really do want to get involved in backyard farming whilst caring about animals, they could rescue a couple of hens from a factory farm and let them live out their lives in relative peace."
    ]
  },
  "food": {
    "description": "Don't eat things resembling meat",
    "rules": "Asking whether any given vegan alternative is made of tofu...which is all vegans eat apparently",
    "main": [
      "For a start, most animal products do not look like animal products. I don't want to spoil any childhood delusions, but fish don't actually have fingers.  Cheese, sausages, fish fingers, they are all creations for a culinary purpose.",
      "Take a burger, is that really an animal food?  People are overly focused on the animal products in a meal when they are often just a portion of the total calories.  In your average fast food hamburger, the patty itself often has grains, flavours, herbs, spices, onions and flour or breadcrumbs added to it.  It is then encased in tomato, lettuce, pickle, onions (beetroot in Australia!) and bread, smothered in sauces.  Often the meat is less than a fifth of the end product which doesn't in anyway resemble, or even taste like the animal that small part came from.  If a vegan replaces that with some other form of protein, we end up with a pretty similar product.",
      "When it comes to what we replace animal protein with, we have a wide array, not just tofu.  Nuts, seeds, grains, vegetables, legumes, yes and soy such as tempeh and tofu all have protein which we can use to make chewy textures in our food.  Plant based foods are getting better and more varied all the time as veganism grows, so we should encourage non vegans to give them a try as a convenient way to have a familiar, but meat free meal.",
      "Ultimately people who ask this are missing the point.  It is oppression and violence that we oppose, not a particular ingredient's texture, shape or flavour. Many vegans avoid products resembling animal foods because they have uncomfortable connotations for them, and that is their right.  Others are happy eating anything so long as they aren't contributing to factory farming, and that is their right.  Both are ethical choices.  People eating animals should focus on the ethics of what they eat, as opposed to the aesthetics of what vegans eat."
    ]
  },
  "natural": {
    "description": "Killing is part of nature",
    "rules": "Making appeals that it has been done for a long time.",
    "main": [
      "OK this gets philosophical so bear with me (no not that sort of bear!).",
      "As much as humans wish for a moral ordered universe, the laws which govern the one we live in are amoral. Good things happen to bad people, terrible things happen to good people, all governed by elegant but soulless cosmic mathematical principles.  It would be nice if it did, but natural just simply does not equal right, just or ethical.",
      "To say then that something is natural and that this is alone needed as a moral defence of the action, would be to ignore the vast number of natural but terrible things that go on. Massive outbreaks of deadly disease used to be common; to intervene with medicine is not purely natural, but surely it would be immoral to do anything else.  Cannibalism, slavery, warfare, all sort of atrocities have long and common histories amongst people, so are they natural and if so is that some valid ethical defense of them?",
      "We make advances in society in fields such as law, justice, democracy, modern medicine and philosophy not by appeals to what is natural but what is best.  Why would the ethics of the way we treat animals be any different.  If we can be just as healthy eating a diet which doesn't oppress tens of billions of other creatures who we share this earth with, then why wouldn't we?",
      "Finally to call the modern diet natural, or the factory farming system with animals locked in cages, in windowless sheds, behind barbed wire, to call all of this abomination natural is to render the word meaningless.",
      "Freedom is the state every sentient being desires.  Vegans help them achieve that natural state."
    ]
  },
  "eat": {
    "description": "What can you eat?",
    "rules": "Oh you are vegan, that must be hard. Veganism is expensive.",
    "main": [
      "Veganism just isn't that hard, as my friend once said, \"Take out the animal things, replace with plant things. Done\".  Not hard.  Maybe slightly harder than not changing at all, but even then after a few weeks it becomes pretty much the same.",
      "Indeed it is often the opposite of a restriction once you try it.  On becoming vegan people discover an expanded world of new and interesting ingredients to explore. Many people also use the process of becoming vegan to transition to a healthier diet, by following all that nutritional advice of \"Eat more fruits and vegetables\".",
      "So if you are eating a healthy diet already, 90% of it is probably already vegan, and the other 10% you just replace with nuts, seeds, beans, legumes, grains, tofu, tempeh, seitan, the ever widening variety of convenient substitute products and plant based milks, soy, almond, macadamia, oat, rice, hemp, quinoa and coconut.  Take a B12 supplement and you are done. If you like there's everything else these days too, plant based cheeses, marshmallows, milk chocolate (most dark choc is already vegan of course), condensed milk, mayonnaise, yoghurt, haggis, black pudding, you get the idea.",
      "Now you will note many of those sources of protein are some of the cheapest things you can feed yourself on, beans, legumes, grains.  Even tofu and tempeh are about as cheap as even budget animal products.  Somehow there is an idea out there that being vegan is expensive.  Like any diet it can be if you choose expensive things.  Pretty much the only expensive vegan ingredients that differ to the modern western diet are the meat and cheese analogues.  You don't have to choose to eat these, or maybe just have them on special occasions.  A vegan diet based on fruits, vegetables and wholegrains is one of the cheapest and healthiest diets out there.",
      "Being vegan is not hard, as much as people might prefer to think it is. As there are more and more vegans all the time, it gets easier too.  The main thing that makes it trying sometimes is the knowledge that there aren't more of us."
    ]
  },
  "notmuch": {
    "description": "I don't each much meat",
    "rules": "Telling you they ate a vegetarian meal recently.",
    "main": [
      "This is a positive and healthy statement, but often people who assert this eat meat every day, often for lunch and dinner, sometimes even breakfast.  I'm not sure what it means actually, maybe that they eat more vegetables than they used to, which is healthy but of little solace to the animals unless it is displacing them in the persons diet.",
      "Our ideas of what a normal diet is are culturally shaped. The fact that someone eats less meat than their unhealthy friend, or chooses fish or chicken instead of red meat, does not equate to not eating much meat.",
      "The average person eats much more meat than is considered healthy. Per capita animal product consumption has risen far above historical levels in many countries.",
      "If someone has more days vegetarian than otherwise, or they only eat meat one meal a day, then they might be able to claim to be not eating much meat, otherwise they are probably eating more than they should.",
      "Obviously for the animals who live and die in agribusiness systems before ending up on a dinner plate, the optimal amount would be zero."
    ]
  },
  "what": {
    "description": "But what about people?",
    "rules": "Some people care more about animals than they do people.",
    "main": [
      "The premise of this statement is that whilst there is human suffering, we shouldn't concern ourselves with the suffering of other animals. Vegans don't believe that such a choice needs to be made and care about the suffering of all animals, humans included.",
      "Indeed they are often related: caring for the environment benefits all who share the earth, teaching compassion helps all who can suffer, switching to a plant based diet is going to allow more food for people to be grown with less land used providing habitat for other animals.",
      "The idea that humans are in a different sphere to all other animals is a pre darwinian conception of ourselves, scientific secular understanding informs us that we are relatives in the same family tree who share traits. All who can suffer deserve consideration and of primary relevance to own conscience should be those who suffer as a direct consequence of how we choose to live.",
      "As many philosophers have said, ethics is like a muscle that goes stronger with use. We should be encouraging compassion in all spheres of life, not playing them off against each other.",
      "Ultimately the question is flawed, people are animals too. We withdraw our support and consent to the unnecessary suffering of all animals, humans included."
    ]
  },
  "cant": {
    "description": "Oh, you can't eat that",
    "rules": "Some ridiculous thing they think isn't vegan.",
    "main": [
      "It is interesting that people frame our avoidance of animal products with the word \"can't\" as if it were not voluntary, rather than \"won't\" which reflects a conscious choice.",
      "Vegans can eat whatever they want, they actively choose not to eat certain products out of concern for the animals involved. Even carnists often refuse to eat some species such as whale, rat or dog, not because they can't but on the basis of habit, cultural or ethical norms.",
      "Vegans take that ethical stance to its logical conclusion. We make active choices based on our principles.",
      "To vegans it's very simple what we eat, wear etc, if it comes directly from an animal, we steer clear of it.  Some other people tend to get enormously confused by the concept, like it has to be hard or something. I've had people ask me if I can eat avocado, peanut butter and even if I could wear cotton - see how you go.  Ultimately it's about educating people, but it would be nice if they thought their comments through a little first."
    ]
  },
  "aspirational": {
    "description": "I'd love to be vegan, but...",
    "rules": "I was vegan/vegetarian but...",
    "main": [
      "The more mainstream veganism becomes and the more society understands the multitude of reasons for living vegan, the more we hear this. It's a sign that veganism has arrived.",
      "Of course as vegans we know it's easy to be vegan in most places, and we can get by in most others with a bag of nuts, some bread and salad to tide us over. Why people don't make the transition has more to do with habit and conformity than anything else.",
      "Ultimately though it is a positive aspirational statement and should be encouraged.  Each time a person says this is a chance to help them achieve something for themselves. Gently gently, we might start by showing them all the free online resources to help them with recipes and advice, then show them the local restaurants or shops stocking vegan products, and probably the most convincing advocacy: introducing them to delicious vegan food and lovely varied vegan people.",
      "For people who used to be vegetarian or vegan, it's often the case that they return to it when their mindset and life is in the right place. Helping people who are already aware of the need for change is one of the most fruitful forms of activism. Also when you meet ex-vegetarians or vegans, it's a good reminder to us that we need to support our own community in our activism, not just focus on making new converts."
    ]
  },
  "preachy": {
    "description": "Vegans are preachy",
    "rules": "Each to their own, the sadly ironic \"live and let live\", or the old joke how do you know someone's vegan - they'll tell you",
    "main": [
      "Granted there are some preachy vegans who need to chill out, but as vegans reflect the diversity of people generally there isn't a stereotype. Anyone who has had bad experiences with a preachy vegan though should try being vegan for a while and see how the reverse is also true.  Not all vegans are preachy, not all people who aren't vegans are tools about it.",
      "It's all perspective too, when local activists erected a billboard showing an injured race horse that was shot, they were forced to take it down as a disturbing image.  Of course our suburbs are littered with burnt charred images of dead animals in food advertisements and no one blinks an eye.  If the vast majority of people agree with you, preachiness seems to go unnoticed.",
      "Ultimately this comes down to people's idea of what life is all about, some think it is just about being popular and conforming, and they can't understand people who would expend their social capital advocating ethical beliefs. They might even express this point of view in cliches such as 'to each their own' or 'live and let live' (if only they would let the animals just live). But as frustrating as we might find this, getting upset with someone is likely to be counter-productive.",
      "We can speak the best for animals by engaging peoples compassion rather than their self defensiveness. Whether we like it or not, how we present the message is almost as important as the message itself.  Positive people living in alignment with their ideals are the best advocates for veganism."
    ]
  }
}
